import re
from typing import Tuple


def merge_white_spaces(txt: str) -> Tuple[str, int]:
    """Використовуючи регулярні вирази та пакет 're' виконайте наступне.
    Для вхідного рядка замініть всі послідовні пробіли, табуляції, тощо на рівно один пробіл.

    Приклад:
        | Встала  весна, \tчорну   землю
        | Сонну \t\t розбудила,
        | Уквітчала \t її рястом,
        | Барвінком  укрила;
        | І    на    полі    жайворонок,
        | Соловейко    \t\t\t \t\t\t в \t \t \t \t гаї
        | Землю,    убрану  \t\t \t\t весною,
        | Вранці \t зустрічають…
    Результат:
        | Встала весна, чорну землю
        | Сонну розбудила,
        | Уквітчала її рястом,
        | Барвінком укрила;
        | І на полі жайворонок,
        | Соловейко в гаї
        | Землю, убрану весною,
        | Вранці зустрічають…
    Args:
        txt (str): Відний текст

    Returns:
        Tuple[str, int]: Вхідний текст без повторних пробілів, та кількість виконаних замін
    """
    raise NotImplementedError("Not implemented")
