import re


def trim_each_line(txt: str) -> str:
    """Використовуючи регулярні вирази та пакет 're' виконайте наступне.
    Для кожного рядка вхідного тексту видаліть з нього усі пробіли на його початку та вкіцнці.
    Сам рядок складається з одного чи більше слів, чисел чи знаків пунктуації.

    Приклад:
        | \t На зеленому горбочку, \t
        | У вишневому садочку,\t
        | Притулилася хатинка,
        | \t Мов маленькая дитинка   \t
    Результат:
        | На зеленому горбочку,
        | У вишневому садочку,
        | Притулилася хатинка,
        | Мов маленькая дитинка
    Args:
        txt (str): Відний текст

    Returns:
        str: Вхідний текст без пробілів на початку чи вкінці рядків
    """
    raise NotImplementedError("Not implemented")
